'''
Выведите 2ᴺ
'''
N = int(input())
print(2**N)
