'''
Дано натуральное число.
Выведите его последнюю цифру.
'''
N = int(input())
print(N % 10)
