'''
Дано положительное двузначное число.
Найдите число десятков в нем.
'''
N = int(input())
print(N // 10)
