'''
Дано целое число N.
Выведите следующее за ним четное число.
'''
N = int(input())
print((N // 2 + 1) * 2)
