'''
Дано положительное действительное число X.
Выведите его дробную часть.
'''
N = float(input())
print(N - int(N))
