'''
Дана строка, состоящая из слов, разделенных пробелами.
Определите, сколько в ней слов.
'''
s = input()
kol = s.count(' ')
print(kol + 1)
