'''
Дана строка.
Удалите из этой строки все символы @.
'''
s = input()
s = s.replace('@', '')
print(s)
